rails-curriculum/w4d3/app/controllers/cat_rental_requests_controller.rb

INSERT INTO "cat_rental_requests" ("cat_id", "created_at", "end_date", "start_date", "status", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cat_id", 1], ["created_at", "2015-09-17 01:26:38.210129"], ["end_date", "2015-09-19"], ["start_date", "2015-09-17"], ["status", "PENDING"], ["updated_at", "2015-09-17 01:26:38.210129"]]
---
  def create
    @rental_request = CatRentalRequest.new(cat_rental_request_params)
    if @rental_request.save