rails-curriculum/w4d3/app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(cat_params)
    @cat.owner = current_user
    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "created_at", "description", "name", "sex", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"