rails-curriculum/w4d2/app/controllers/cat_rental_requests_controller.rb

SELECT "cats".* FROM "cats"
---
  def new
    @cat_rental_request = CatRentalRequest.new
    @cats = Cat.all.sort

INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "status") VALUES ($1, $2, $3, $4) RETURNING "id"  [["cat_id", 1], ["start_date", "2015-09-15"], ["end_date", "2015-09-23"], ["status", "PENDING"]]
SELECT "cats".* FROM "cats"
---
  def create
    @cat_rental_request = CatRentalRequest.new(cat_rental_request_params)
    if @cat_rental_request.save
      redirect_to cat_rental_request_url(@cat_rental_request)
    else
      @cats = Cat.all.sort

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT 1  [["id", 5]]
---
  def show
    @cat_rental_request = CatRentalRequest.find(params[:id])

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT 1  [["id", 3]]
---
  def approve
    @cat_rental_request = CatRentalRequest.find(params[:id])

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT 1  [["id", 5]]
---
  def deny
    @cat_rental_request = CatRentalRequest.find(params[:id])