rails-curriculum/w4d2/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
---
  def index
    @cats = Cat.all.sort

INSERT INTO "cats" ("name", "color", "birth_date", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Mihir"], ["color", "red"], ["birth_date", "1995-03-31"], ["sex", "M"], ["description", ""], ["created_at", "2015-09-15 20:40:23.739689"], ["updated_at", "2015-09-15 20:40:23.739689"]]
---
  def create
    @cat = Cat.new(cat_params)
    if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "cats" SET "color" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "red"], ["description", "Ssup?"], ["updated_at", "2015-09-15 21:06:16.670853"], ["id", 3]]
---
  def update
    @cat = Cat.find(params[:id])
    if @cat.update(cat_params)